mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
                anemometroModoActivo = uartGetMode();

                medProgFlag = 0;

                if (anemometroModoActivo == Medicion_Continua) {
                    //                    vTaskDelayUntil(&xLastWakeTime, (medPeriod * 1000) / portTICK_PERIOD_MS);
                }

                break;
            case Configuracion:
                configOption = uartGetModeConfig();

                switch (configOption) {
                    case CalCero:
                        xQueueReceive(qRecf, &soundSpeed, portMAX_DELAY);

                        //                        anemometroDelayTest();
                        if (soundSpeed == 999.99) {
                            detect_delta_O = (float) DETECTION_ERROR_O;
                            detect_delta_E = (float) DETECTION_ERROR_E;
                            detect_delta_N = (float) DETECTION_ERROR_N;
                            detect_delta_S = (float) DETECTION_ERROR_S;
                        } else {
                            anemometroCalibCero(soundSpeed);
                        }

                        simpleMed.mag = detect_delta_O * 1000000;
                        simpleMed.deg = detect_delta_E * 1000000;
                        uartSendMed(&simpleMed);

                        simpleMed.mag = detect_delta_N * 1000000;
                        simpleMed.deg = detect_delta_S * 1000000;
                        uartSendMed(&simpleMed);
                        simpleMed.mag = 0;
                        simpleMed.deg = 0;

                        configOption = ExitConfig;
                        break;
                    case SetEmi:
                        configOption = uartGetModeConfig();
                        if (configOption == 1) emisorSelect = TRANS_EMISOR_NORTE;
                        if (configOption == 2) emisorSelect = TRANS_EMISOR_SUR;
                        if (configOption == 3) emisorSelect = TRANS_EMISOR_ESTE;
                        if (configOption == 4) emisorSelect = TRANS_EMISOR_OESTE;
                        configOption = ExitConfig;
                        break;
                    case SetPeriod:
                        configOption = uartGetModeConfig();
                        if (configOption == 1) medPeriod = 5;
                        if (configOption == 2) medPeriod = 10;
                        if (configOption == 3) medPeriod = 30;
                        if (configOption == 4) medPeriod = 60;
                        if (configOption == 5) medPeriod = 600;
                        configOption = ExitConfig;
                        break;
                    case ExitConfig:
                        anemometroModoActivo = Menu;
                        break;
                    default: anemometroModoActivo = Menu;
                }

                anemometroModoActivo = Menu;
                break;
            default: anemometroModoActivo = Menu;
        }
    }
}

BaseType_t anemometroVmedian(float* medOE, float* medNS) {
    BaseType_t medState = pdFAIL;
    float timeMedian[4];
    float timeCorr[2];

    medState = anemometroGetTmedian(&timeMedian[0], &timeMedian[1], TRANS_EMISOR_OESTE);

    medState *= anemometroGetTmedian(&timeMedian[2], &timeMedian[3], TRANS_EMISOR_NORTE);

    if (medState == pdFAIL) return pdFAIL;

    //Calculo V para OE
    timeCorr[0] = timeMedian[0] - detect_delta_O; //taOE
    timeCorr[1] = timeMedian[1] - detect_delta_E; //trOE

    if (timeCorr[0] == timeCorr[1]) {
        *medOE = 0;
    } else {
        *medOE = (((float) DISTANCE_EO / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_EO;
        *medOE = (*medOE - DETECT_OFFSET_OE) / DETECT_SCALING_OE;
    }
    //Calculo V para NS
    timeCorr[0] = timeMedian[2] - detect_delta_N; //taNS
    timeCorr[1] = timeMedian[3] - detect_delta_S; //trNS

    if (timeCorr[0] == timeCorr[1]) {
        *medNS = 0;
    } else {
        *medNS = (((float) DISTANCE_NS / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_NS;
        *medNS = (*medNS - DETECT_OFFSET_NS) / DETECT_SCALING_NS;
    }

    return medState;
}

BaseType_t anemometroGetTmedian(float* medianA, float* medianB, mux_transSelect_enum coordV) {
    float timeMed[] = {0, 0};
    uint8_t i = 0;
    uint8_t n = 0;
    uint8_t correctMeds = 0;
    float timeNmediciones[N_TIMER_MEDIAN];
    BaseType_t medState = pdPASS;

    for (i = 0; i < 2; i++) {
        for (n = 0; n < N_TIMER_MEDIAN; n++) {

            correctMeds += (uint8_t) anemometroGetCoordTime(&timeNmediciones[n], coordV + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);
        }
        if (correctMeds > (N_TIMER_MEDIAN / 2)) {
            medState = anemometroFindMedian(timeNmediciones, &timeMed[i], N_TIMER_MEDIAN);
            correctMeds = 0;
        } else {
            return pdFAIL;
        }
    }

    if (medState == pdPASS) {
        //DEBUG: ajuste ventanas
        //        *medianA = timeMed[0] * 1000000;
        //        *medianB = timeMed[1] * 1000000;
        *medianA = timeMed[0];
        *medianB = timeMed[1];
    }

    return medState;
}

BaseType_t anemometroGetTmode(float* modeA, float* modeB, mux_transSelect_enum coordV) {
    float timeMed[] = {0, 0};
    float timeNmediciones[N_TIMER_MODE];
    uint8_t i = 0;
    uint8_t n = 0;
    BaseType_t medState = pdFAIL;

    for (i = 0; i < 2; i++) {
        for (n = 0; n < N_TIMER_MODE; n++) {

            anemometroGetCoordTime(&timeNmediciones[n], coordV + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);
        }
        medState = anemometroCalcMode(timeNmediciones, &timeMed[i], N_TIMER_MODE);
    }
    //DEBUG: ajuste ventanas
    //    *modeA = timeMed[0] * 1000000;
    //    *modeB = timeMed[1] * 1000000;

    *modeA = timeMed[0];
    *modeB = timeMed[1];

    return medState;
}

float anemometroGetVcoord(mux_transSelect_enum coordV) {
    float valMed = 0;
    float timeMed[] = {0, 0};
    float timeNmediciones[N_TIMER_MODE];
    uint8_t i = 0;
    uint8_t n = 0;
    float timeCorr[2];

    for (i = 0; i < 2; i++) {
        for (n = 0; n < N_TIMER_MODE; n++) {

            anemometroGetCoordTime(&timeNmediciones[n], coordV + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);
        }
        anemometroCalcMode(timeNmediciones, &timeMed[i], N_TIMER_MODE);
    }

    if (timeMed[0] == 0 || timeMed[1] == 0 || timeMed[0] > 100 || timeMed[1] > 100) {
        valMed = 666.66;
    } else {
        //Calculo 
        switch (coordV) {
            case TRANS_EMISOR_OESTE:
                //Corrijo los tiempos medidos
                timeCorr[0] = timeMed[0] - detect_delta_O; //taOE
                timeCorr[1] = timeMed[1] - detect_delta_E; //trOE

                if (timeCorr[0] == timeCorr[1]) {
                    return 0;
                }
                //Si los dos tiempos desfasan para el mismo lado la medicion carece de sentido
                //                if ((timeCorr[0] < DETECTION_CERO_MIN && timeCorr[1] < DETECTION_CERO_MIN) ||
                //                        (timeCorr[0] > DETECTION_CERO_MAX && timeCorr[1] > DETECTION_CERO_MAX)) {
                //                    return 555.55;
                //                }

                /*La definicion de las coordenadas es tal que si el viento sopla 
                 * DESDE el NORTE el angulo es 0°
                 *si sopla DESDE el OESTE el angulo es 90°
                 * El angulo va de 0° a 360°
                 */
                valMed = (((float) DISTANCE_EO / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_EO;
                valMed = (valMed - DETECT_OFFSET_OE) / DETECT_SCALING_OE;
                break;
            case TRANS_EMISOR_NORTE:
                //Corrijo los tiempos medidos
                timeCorr[0] = timeMed[0] - detect_delta_N;
                timeCorr[1] = timeMed[1] - detect_delta_S;

                if (timeCorr[0] == timeCorr[1]) {
                    return 0;
                }

                //                if ((timeCorr[0] < DETECTION_CERO_MIN && timeCorr[1] < DETECTION_CERO_MIN) ||
                //                        (timeCorr[0] > DETECTION_CERO_MAX && timeCorr[1] > DETECTION_CERO_MAX)) {
                //                    return 555.55;
                //                }

                valMed = (((float) DISTANCE_NS / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_NS;
                valMed = (valMed - DETECT_OFFSET_NS) / DETECT_SCALING_NS;
                break;
            default:
                valMed = 444.44;
        }
    }

    return valMed;
}

BaseType_t anemometroVmode(float* medOE, float* medNS, uint8_t Nmode) {
    BaseType_t modeState = pdPASS;
    float velNmedicionesR[N_MED_MODE];
    float velNmedicionesT[N_MED_MODE];
    float timeMode[4];
    uint8_t n = 0, i = 0;
    float timeCorr[] = {0, 0};

    for (i = 0; i < 4; i += 2) {
        for (n = 0; n < N_MED_MODE; n++) {

            anemometroGetTmode(&velNmedicionesR[n], &velNmedicionesT[n], TRANS_EMISOR_OESTE + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);

