mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
void anemometroReceptorDelay(mux_transSelect_enum emisor) {
    switch (emisor) {
        case TRANS_EMISOR_OESTE:
            DELAY_O;
            break;
        case TRANS_EMISOR_ESTE:
            DELAY_E;
            break;
        case TRANS_EMISOR_NORTE:
            DELAY_N;
            break;
        case TRANS_EMISOR_SUR:
            DELAY_S;

            break;
        default: DELAY_N;
    }
}

/*Configura los pines de salida del PORTA: RA1 = A y RA0 = B*/
BaseType_t anemometroMuxOutputSelect(mux_transSelect_enum ch) {
    switch (ch) {
        case TRANS_EMISOR_OESTE:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
        case TRANS_EMISOR_ESTE:
            MUX_INPUT_A(1);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
        case TRANS_EMISOR_NORTE:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(1);
            break;
        case TRANS_EMISOR_SUR:
            MUX_INPUT_A(1);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(1);
            break;
        default:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
    }
    DELAY_50uS;
    //    vTaskDelay(20 / portTICK_PERIOD_MS);

    return pdTRUE;
}

BaseType_t anemometroFindMedian(float* pData, float* pMedian, uint16_t nData) {
    uint16_t i, j;
    float aux = 0;
    uint16_t indexMedian = 0;

    for (i = 0; i < nData - 1; i++) {
        for (j = 0; j < nData - i - 1; j++) {
            if (pData[j] > pData[j + 1]) {
                aux = *(pData + j);
                *(pData + j) = *(pData + j + 1);
                *(pData + j + 1) = aux;
            }
        }
    }
    indexMedian = (nData + 1) / 2 - 1;

    if (indexMedian >= 0 && indexMedian <= nData) {
        *pMedian = pData[indexMedian];
        return pdPASS;
    } else {
        return pdFAIL;
    }
}

BaseType_t anemometroCalcMode(float* pData, float* pMode, uint16_t nData) {
    float c[N_TIMER_MODE];
    uint8_t i, j;

    if (nData > N_TIMER_MODE) return pdFAIL;

    //Inicializo matriz auxiliar
    for (i = 0; i < N_TIMER_MODE; i++) {
        c [ i ] = 0;
    }
    /* Comparo cada elemento de los datos
     * si uno se repite cuento en el mismo indice de la matriz auxiliar
     * y borro de los datos el segundo de los elementos repetidos
     */
    for (i = 0; i < nData; i++) {
        for (j = 0; j < nData; j++) {
            if ((*(pData + i) == *(pData + j)) && (i != j) && (*(pData + i) != 0)) {
                c [ i ] += 1;
                *(pData + j) = 0;
            }
        }
    }

    i = 0;

    /* Recorro la matriz auxiliar
     * el indice con el numero mas alto sera el indice de la moda (i)
     */
    for (j = 0; j < nData; j++) {
        if (c[i] > c[j] && (i != j)) {
            c[j] = 0;
        } else if (i != j) {
            c[i] = 0;
            i = j;
        }
    }

    *pMode = *(pData + i);

    return pdPASS;
}

void anemometroCalibCero(float Sspeed) {
    float ceroMed[N_TIMER_MODE];
    uint8_t i = 0, j = 0;
    float ceroMode[4];

    for (j = 0; j < 4; j++) {
        for (i = 0; i < N_TIMER_MODE; i++) {

            anemometroGetCoordTime(&ceroMed[i], (mux_transSelect_enum) j);
            vTaskDelay(10 / portTICK_PERIOD_MS);
        }
        //Mido el tiempo de pulso sin viento para cada coordenada
        anemometroCalcMode(ceroMed, &ceroMode[j], N_TIMER_MODE);
    }
    detect_delta_O = (float) ceroMode[0] - DISTANCE_EO / Sspeed;
    detect_delta_E = (float) ceroMode[1] - DISTANCE_EO / Sspeed;
    detect_delta_N = (float) ceroMode[2] - DISTANCE_NS / Sspeed;
    detect_delta_S = (float) ceroMode[3] - DISTANCE_NS / Sspeed;
}

void anemometroAbortMed(void) {
    if (medProgFlag == 0) {
        anemometroModoActivo = Menu;
        medAborted = 1;
        xTaskAbortDelay(xMainTaskHandle);
    }
}

void anemometroDelayTest(void) {
    char msg[30];
    float medAux = 0;

    anemometroGetCoordTime(&medAux, TRANS_EMISOR_OESTE);
    if (dma_ceroAligned(TRANS_EMISOR_OESTE) == pdPASS) {
        sprintf(msg, "\r\n Delay emisor OESTE: OK%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    } else {
        sprintf(msg, "\r\n Delay emisor OESTE: error%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    }
    vTaskDelay(10 / portTICK_PERIOD_MS);

    anemometroGetCoordTime(&medAux, TRANS_EMISOR_ESTE);
    if (dma_ceroAligned(TRANS_EMISOR_ESTE) == pdPASS) {
        sprintf(msg, "  ESTE: OK%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    } else {
        sprintf(msg, "  ESTE: error%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    }
    vTaskDelay(10 / portTICK_PERIOD_MS);

    anemometroGetCoordTime(&medAux, TRANS_EMISOR_NORTE);
    if (dma_ceroAligned(TRANS_EMISOR_NORTE) == pdPASS) {
        sprintf(msg, "  NORTE: OK%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    } else {
        sprintf(msg, "  NORTE: error%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    }
    vTaskDelay(10 / portTICK_PERIOD_MS);

    anemometroGetCoordTime(&medAux, TRANS_EMISOR_SUR);
    if (dma_ceroAligned(TRANS_EMISOR_SUR) == pdPASS) {
        sprintf(msg, "  SUR: OK\r\n%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    } else {
        sprintf(msg, "  SUR: error\r\n%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    }
    vTaskDelay(10 / portTICK_PERIOD_MS);
}

static void prvSetupHardware(void) {
#ifdef _PLLACTIVATED_
    // Configure Oscillator to operate the device at 40Mhz
    // Fosc= Fin*M/(N1*N2), Fcy=Fosc/2 = 40MHz
    // Fosc= 20M*32/(4*2)=80Mhz for 20M input clock
    PLLFBD = 30; // M=32
    CLKDIVbits.PLLPRE = 2; // N1=4
    CLKDIVbits.PLLPOST0 = 0; // N2=2
    CLKDIVbits.PLLPOST1 = 0;

    // Clock Switch to incorporate PLL
    __builtin_write_OSCCONH(0x03); // Initiate Clock Switch to 
    // FRC with PLL (NOSC=0b001)
    __builtin_write_OSCCONL(OSCCON | 0x01); // Start clock switching
    while (OSCCONbits.COSC != 0b011); // Wait for Clock switch to occur	

    // Wait for PLL to lock
    while (OSCCONbits.LOCK != 1) {
    };
#endif
    //Desactivo watchdog

    RCONbits.SWDTEN = 0;

    /* set LED0 pins as outputs */
    TRISAbits.TRISA4 = 0;
    DELAY_100uS;
    //Set mux control pins as outputs
    TRISAbits.TRISA0 = 0;
    DELAY_100uS;
    TRISAbits.TRISA1 = 0;
    DELAY_100uS;
    TRISBbits.TRISB4 = 0;
    DELAY_100uS;
    TRISBbits.TRISB9 = 0;
    DELAY_100uS;
    //    RB_8_SET_MODE(1);
    //    DELAY_100uS;
    RB_9_SET_MODE(0);
    DELAY_100uS
}

void vApplicationIdleHook(void) {

}